In [1]:
#4 import the required packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import scipy.stats as stats
import statsmodels.api as sm
%matplotlib inline

In [2]:
#read the fullsmple file

initial = 'data/fullsample.csv'
initial_data = pd.read_csv(initial)

In [3]:
initial_data.shape

(4365379, 12)

In [4]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,14-00:00:00,11-01:32:50,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,13-18:00:00,12-09:26:41,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,13-18:00:00,13-08:27:36,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,13-18:00:00,12-03:50:59,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,13-18:00:00,11-08:43:46,1,1,production,0:0,2019-03-11T10:06:06

In [5]:
initial_data.tail()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
4365374,12741062_145,mickey,boyce,4096Mc,462.90M,00:10:00,00:01:44,1,1,production,0:0,2019-09-25T14:22:03
4365375,12741062_146,mickey,boyce,4096Mc,462.89M,00:10:00,00:01:44,1,1,production,0:0,2019-09-25T14:22:03
4365376,12741062_147,mickey,boyce,4096Mc,553.77M,00:10:00,00:01:53,1,1,production,0:0,2019-09-25T14:22:03
4365377,12741062_148,mickey,boyce,4096Mc,557.09M,00:10:00,00:01:52,1,1,production,0:0,2019-09-25T14:22:03
4365378,12741062_149,mickey,boyce,4096Mc,616.77M,00:10:00,00:01:52,1,1,production,0:0,2019-09-25T14:22:03

In [6]:
initial_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4365379 entries, 0 to 4365378
Data columns (total 12 columns):
JOBID        object
ACCOUNT      object
USER         object
REQMEM       object
USEDMEM      object
REQTIME      object
USEDTIME     object
NODES        int64
CPUS         int64
PARTITION    object
EXITCODE     object
SUBMIT       object
dtypes: int64(2), object(10)
memory usage: 399.7+ MB

In [7]:
initial_data.columns

Index(['JOBID', 'ACCOUNT', 'USER', 'REQMEM', 'USEDMEM', 'REQTIME', 'USEDTIME',
       'NODES', 'CPUS', 'PARTITION', 'EXITCODE', 'SUBMIT'],
      dtype='object')

In [8]:
#remove duplicate rows
initial_data=initial_data.drop_duplicates()

In [9]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,14-00:00:00,11-01:32:50,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,13-18:00:00,12-09:26:41,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,13-18:00:00,13-08:27:36,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,13-18:00:00,12-03:50:59,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,13-18:00:00,11-08:43:46,1,1,production,0:0,2019-03-11T10:06:06

In [10]:
#keep only data that has partition= production 
initial_data=initial_data.loc[initial_data['PARTITION']=='production']

In [11]:
initial_data.shape

(3319257, 12)

In [12]:
#keep only successful jobs. meaning keep all exit code that contain 0:0
#initial_data=initial_data.loc[initial_data['EXITCODE']=='0:0']
#we will use this for qeustions 3 and 4

In [13]:
initial_data.shape

(3319257, 12)

In [14]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,14-00:00:00,11-01:32:50,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,13-18:00:00,12-09:26:41,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,13-18:00:00,13-08:27:36,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,13-18:00:00,12-03:50:59,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,13-18:00:00,11-08:43:46,1,1,production,0:0,2019-03-11T10:06:06

In [15]:
#remove the - from the reqtime and usedtime
initial_data.REQTIME=initial_data.REQTIME.str.replace('-',':')
initial_data.USEDTIME=initial_data.USEDTIME.str.replace('-',':')

In [16]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,14:00:00:00,11:01:32:50,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,13:18:00:00,12:09:26:41,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,13:18:00:00,13:08:27:36,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,13:18:00:00,12:03:50:59,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,13:18:00:00,11:08:43:46,1,1,production,0:0,2019-03-11T10:06:06

In [17]:
date_time=initial_data.REQTIME

In [18]:
%%time
#covert the REQTIME to total seconds
#initialize the to_secods df outside of the loop
to_seconds=[]
for time in date_time:
    split=time.split(':')
    if len(split)==4:
        seconds=int(split[0])*86400+int(split[1])*3600+int(split[2])*60+int(split[3])
        to_seconds.append(seconds)
    else:
        seconds=int(split[0])*3600+int(split[1])*60+int(split[2])
        to_seconds.append(seconds)

CPU times: user 6.11 s, sys: 58.1 ms, total: 6.16 s
Wall time: 6.16 s

In [19]:
#now set the results of the loop back in the REQTIME column
initial_data['REQTIME']=to_seconds

In [20]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808Mn,115217.12M,1209600,11:01:32:50,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288Mn,6516.10M,1188000,12:09:26:41,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288Mn,0.09M,1188000,13:08:27:36,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288Mn,8333.82M,1188000,12:03:50:59,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288Mn,8304.03M,1188000,11:08:43:46,1,1,production,0:0,2019-03-11T10:06:06

In [21]:
#used_time=initial_data.USEDTIME

In [22]:
#covert the USEDTIME to total seconds
#another way to do seconds conversion. do a function 
def convert_to_seconds(new):
    split_again=new.split(':')
    if len(split_again)==4:
        sec_2=int(split_again[0])*86400+int(split_again[1])*3600+int(split_again[2])*60+int(split_again[3])
        
    else:
        sec_2=int(split_again[0])*3600+int(split_again[1])*60+int(split_again[2])
        
    return sec_2

In [23]:
#my function worked
convert_to_seconds('11:01:32:50')

955970

In [24]:
%%time
#use the fuction created to covert the USEDTIME column to seconds
initial_data.USEDTIME=initial_data.USEDTIME.apply(convert_to_seconds)

CPU times: user 5.96 s, sys: 168 ms, total: 6.13 s
Wall time: 5.94 s

In [25]:
#initial_data.head()

In [26]:
#add a space between the value and the units(Mn or Mc)
reqmem=initial_data['REQMEM'].str.replace(r'(Mn|Mc)',r' \1')
#save this back to original to make the changes. 
initial_data.REQMEM=reqmem

In [27]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,247808 Mn,115217.12M,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288 Mn,6516.10M,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288 Mn,0.09M,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288 Mn,8333.82M,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288 Mn,8304.03M,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [28]:
#convert Mn to Mc using a function 
def convert_to_mc(x,y,z):
    #cut_mn=x.replace(r'(Mn|Mc)',r' \1')
    num_unit=x.split(' ')
    #print(num_unit[0])
    number=int(num_unit[0])
    unit=num_unit[1]
    if unit=='Mn':
        mc_conversion=(number*y)/(z)
    else:
        mc_conversion=number
        
    return mc_conversion

In [29]:
%%time
initial_data['REQMEM']=initial_data.apply(lambda row: convert_to_mc(row['REQMEM'],row['NODES'],row['CPUS']),axis=1)

CPU times: user 1min 50s, sys: 1.09 s, total: 1min 51s
Wall time: 1min 50s

In [30]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,115217.12M,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.10M,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09M,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82M,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03M,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [31]:
#add the space between the value and the unit(M)
usedmem=initial_data['USEDMEM'].str.replace(r'(M)',r' \1')
#save this back to the original. now has the space added.
initial_data.USEDMEM=usedmem

In [32]:
#initial_data.head()

In [33]:
initial_data.shape

(3319257, 12)

In [34]:
initial_data.loc[initial_data['CPUS']==0]
#or you can use this 
#initial_data[initial_data['CPUS']==0]

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
1556155,9524253,kumquat,kate,16384.0,16383.34 M,86400,35114,24,0,production,0:0,2019-07-01T14:22:00

In [35]:
#find the index of the row you wanted deleted 
initial_data[initial_data['CPUS']==0].index

Int64Index([1556155], dtype='int64')

In [36]:
#delet the row using the index id of the row you want deleted. 
initial_data.drop(initial_data[initial_data['CPUS']==0].index,inplace=True)
#dfObj.drop( dfObj[ dfObj['Age'] == 30 ].index , inplace=True)

In [37]:
initial_data.shape

(3319256, 12)

In [38]:
initial_data[initial_data['USEDMEM']=='0'].head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
3645,7239987_1,almonds,robt,4096.0,0,1800,20,1,1,production,0:0,2019-03-20T07:31:32
4233,7241024_4,clara,gemma,8192.0,0,7200,6,1,1,production,0:0,2019-03-20T08:32:02
4235,7241024_2,clara,gemma,8192.0,0,7200,5,1,1,production,0:0,2019-03-20T08:32:02
4236,7241024_3,clara,gemma,8192.0,0,7200,4,1,1,production,0:0,2019-03-20T08:32:02
4239,7241033_1,clara,gemma,8192.0,0,7200,32,1,1,production,0:0,2019-03-20T08:33:03

In [39]:
#convert M to Mc using a function 
def m_to_mc(a,b,c):
    if a =='0':
        mc=a
    else:
        split_it=a.split(' ')
        value=float(split_it[0])
        letter=split_it[1]
        mc=(value*b)/(c)
        
    return mc

In [40]:
%%time
initial_data['USEDMEM']=initial_data.apply(lambda row: m_to_mc(row['USEDMEM'],row['NODES'],row['CPUS']),axis=1)

CPU times: user 1min 47s, sys: 974 ms, total: 1min 48s
Wall time: 1min 48s

In [41]:
#exported my clean data to use for other steps
export_clean_data=initial_data.to_csv('data/clean_data.csv',index=None)

In [42]:
initial_data.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.1,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [43]:
#using a new data frame to only have array jobs. 
array_only_ids=initial_data

In [44]:
#array_jobs=array_only_ids[['JOBID']]
#array_jobs.head()

In [45]:
%%time 
def array_jobs(job):
    array_split=job.split('_')
    if len(array_split)==2:
        jobs=job#array_split
    else:
        jobs=0
        
    return jobs

CPU times: user 8 µs, sys: 1 µs, total: 9 µs
Wall time: 15 µs

In [46]:
%time
array_only_ids.JOBID=array_only_ids.JOBID.apply(array_jobs)
#initial_data.USEDTIME=initial_data.USEDTIME.apply(convert_to_seconds)

CPU times: user 5 µs, sys: 1 µs, total: 6 µs
Wall time: 9.78 µs

In [47]:
array_only_ids.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,0,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.1,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [48]:
array_only_ids.drop(array_only_ids[array_only_ids['JOBID']==0].index,inplace=True)

In [49]:
array_only_ids.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
1,6983193_1880,discovery,serina,12288.0,6516.1,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06
5,7055502_1823,discovery,serina,12288.0,7693.11,1188000,789220,1,1,production,0:0,2019-03-11T10:06:06

In [50]:
array_only_ids[['number','sub_number']]=array_only_ids.JOBID.str.split('_',expand=True)

In [51]:
array_only_ids.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT,number,sub_number
1,6983193_1880,discovery,serina,12288.0,6516.1,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59,6983193,1880
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06,7055502,1863
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06,7055502,1800
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06,7055502,1806
5,7055502_1823,discovery,serina,12288.0,7693.11,1188000,789220,1,1,production,0:0,2019-03-11T10:06:06,7055502,1823

In [52]:
array_only_ids.shape

(2575548, 14)

In [53]:
#array_only_ids.number[array_only_ids.USEDTIME<300]

In [54]:
#give me only data with USEDTIME <300 i.e. 5 minutes
array_only_ids=array_only_ids[array_only_ids.USEDTIME<300]

In [55]:
array_only_ids.shape

(696855, 14)

In [56]:
array_of_ids=array_only_ids.groupby(['number','USER','EXITCODE'],as_index=False)[['JOBID']].count()

In [57]:
array_of_ids.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17488 entries, 0 to 17487
Data columns (total 4 columns):
number      17488 non-null object
USER        17488 non-null object
EXITCODE    17488 non-null object
JOBID       17488 non-null int64
dtypes: int64(1), object(3)
memory usage: 683.1+ KB

In [58]:
#this is the users who commited <500 jobs that were <5 minutes.
array_of_ids.head()

     number    USER EXITCODE  JOBID
0  10000883   boyce      0:0      6
1  10007652  stacey      0:0      1
2  10007726  stacey      0:0      2
3  10007826  gerrit      0:0     50
4  10008050  gerrit      0:0     50

In [59]:
array_of_ids=array_of_ids[array_of_ids.JOBID>500]

In [60]:
#This is the number of times each person committed that criteria
array_of_ids.groupby('USER')[['number']].count()

          number
USER
alf            3
alisson        1
archie         2
baylee         7
benson        19
boyce         31
brande        22
demarcus       7
hjalmar        2
jermaine       1
kaye           1
lashawn        2
macey          1
obie           3
osborne        1
pamelia        1
somer          1
stefanie       1
tegan          2
tommie        62
vaughn         1
whitley        6

In [61]:
#this shows that all these long arrays of short jobs had exitcode of 0:0
#array_of_ids[array_of_ids.EXITCODE=='0:0']

In [62]:
#bring in clean data in new dataframe to work with part 2 of questions one which asks:
#Lots of small jobs submitted together within a 4-hour window,regardless of whether or not they were in an array
er='data/clean_data.csv'
error_code = pd.read_csv(er)

In [63]:
error_code.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [65]:
#how many jobs were unsuccessful. i.e. exitcode not equal '0:0'
error_code=error_code[error_code.EXITCODE!='0:0']
#array_only_ids=array_only_ids[array_only_ids.USEDTIME<300]

In [357]:
error_code

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
16652,7269184,atemoyas,benson,1024.0,1023.8300,1500,1435,1,1,production,0:125,2019-03-21T18:38:42
23910,7281699,pinole,christa,1024.0,430.7200,1800,41,2,1,production,7:0,2019-03-22T08:37:35
24000,7281822,pinole,christa,6144.0,0.0000,1800,22,1,1,production,7:0,2019-03-22T08:47:42
24274,7282440,blood,jonnie,12288.0,0.1800,1800,19,2,1,production,7:0,2019-03-22T09:36:29
24394,7282671,pinole,christa,1024.0,0.1600,1800,31,2,1,production,7:0,2019-03-22T10:06:30
24401,7282688,pinole,christa,1024.0,0.1800,1800,15,2,1,production,7:0,2019-03-22T10:08:59
24416,7282745,pinole,christa,1024.0,360.1200,1800,36,2,1,production,7:0,2019-03-22T10:16:00
24742,7283718,morita,collins,1024.0,29.7500,6300,98,1,1,production,0:15,2019-03-22T11:43:06
127092,7484076,pecans,suzy,20480.0,13812.8700,28800,12742,1,1,production,0:9,2019-04-01T10:51:03
144738,7529919,pecans,suzy,30720.0,0.7400,28800,11793,1,1,production,0:9,2019-04-03T20:10:54
150767,7543154,milwa,charlotte,16384.0,216.8100,259200,320,99,1,production,0:12,2019-04-04T12:20:53
182059,7612498,pecans,acie,10000.0,2.0500,28800,10357,1,1,production,0:9,2019-04-07T15:57:28
197848,7641672,laxtons,otis,120.0,9.5800,10800,5507,1,1,production,0:9,2019-04-08T14:26:02
212673,7665711,laxtons,otis,120.0,0.8900,32400,11562,1,1,production,0:9,2019-04-09T08:41:08
212677,7665719,laxtons,otis,120.0,0.8500,32400,11566,1,1,production,0:9,2019-04-09T08:41:36
215652,7669863,pecans,suzy,20480.0,197.3800,28800,8075,1,1,production,0:9,2019-04-09T10:15:17
215764,7670118,pecans,acie,10000.0,3.6800,14400,12299,1,1,production,0:9,2019-04-09T10:28:55
215803,7670164,pecans,acie,20000.0,3.5300,14400,12152,1,1,production,0:9,2019-04-09T10:30:32
215804,7670165,pecans,acie,20000.0,3.4300,14400,12154,1,1,production,0:9,2019-04-09T10:31:49
216734,7672625,laxtons,otis,120.0,6.4500,14400,9159,1,1,production,0:9,2019-04-09T14:27:02
219164,7678686,pecans,suzy,20480.0,287.0700,28800,5884,1,1,production,0:9,2019-04-09T20:17:00
229684,7699561,laxtons,otis,120.0,9.6600,7200,4771,1,1,production,0:9,2019-04-10T15:26:56
251187,7738523,morita,collins,1024.0,70648.1800,36000,49,23,1,production,1:0,2019-04-12T12:59:59
257566,7749470,morita,collins,1024.0,0.4300,6300,93,1,1,production,0:6,2019-04-12T18:45:42
264637,7764415,pecans,acie,10000.0,8.9500,21600,14786,1,1,production,0:9,2019-04-13T08:42:10
326646,7892385,laxtons,otis,120.0,3.2900,14400,13347,1,1,production,0:9,2019-04-19T11:10:09
327476,7894163,mixed,tavaris,1024.0,65.6300,28800,6484,1,1,production,0:9,2019-04-19T13:13:20
327862,7895138,mixed,tavaris,1024.0,963.9500,28800,2176,1,1,production,0:125,2019-04-19T14:50:41
327925,7895250,carrot,ari,1024.0,0.0000,7200,0,2,8,production,2:0,2019-04-19T15:02:19
328072,7895503,mixed,tavaris,8000.0,22.4600,28800,2236,1,1,production,0:9,2019-04-19T15:19:12
...,...,...,...,...,...,...,...,...,...,...,...,...
1604925,10226006,durondeau,ginger,9216.0,1237.8150,172800,5,9,2,production,1:0,2019-07-23T07:45:32
1727641,10451525,sunburst,belia,16384.0,14.6200,604800,14,8,8,production,0:9,2019-07-30T12:46:27
1733676,10459870,melogold,destin,153600.0,419.1700,43200,0,1,1,production,1:0,2019-07-30T18:41:16
1733678,10459874,melogold,destin,153600.0,419.1100,43200,0,1,1,production,1:0,2019-07-30T18:42:52
1733681,10459878,melogold,destin,153600.0,419.2500,43200,0,1,1,production,1:0,2019-07-30T18:43:33
1830654,10623992,turban,andra,4096.0,908.0575,14400,7156,1,4,production,0:9,2019-08-06T14:20:52
2041123,10896902,kumquat,icey,1024.0,0.7950,86400,1,1,4,production,1:0,2019-08-15T16:22:20
2325414,11306483,melogold,destin,153600.0,512.3800,86400,0,1,1,production,1:0,2019-08-24T13:53:44
2325415,11306487,melogold,destin,153600.0,512.4500,86400,0,1,1,production,1:0,2019-08-24T13:54:55
2325417,11306497,melogold,destin,153600.0,512.3300,86400,1,1,1,production,1:0,2019-08-24T13:56:01
2325502,11306648,melogold,destin,153600.0,512.5600,86400,0,1,1,production,1:0,2019-08-24T14:01:04
2326238,11307711,president,diandra,1024.0,994.8500,18000,15329,1,1,production,0:125,2019-08-24T14:56:01
2346820,11336242,cepuna,luvinia,1024.0,2046.3000,18000,608,2,1,production,0:9,2019-08-25T11:05:21
2397027,11411510,sunburst,belia,131072.0,210.8000,604800,985,8,1,production,0:9,2019-08-27T10:29:33
2556567,11648958,baby,christina,1024.0,4.7300,1800,404,1,1,production,0:9,2019-09-02T00:19:03
2612127,11763723,forelle,cleva,5120.0,197629.6400,57600,6444,83,1,production,0:15,2019-09-05T15:56:21
2612155,11763797,forelle,cleva,5120.0,212053.4000,21600,6734,65,1,production,0:15,2019-09-05T16:01:19
2659469,11874447,melogold,destin,153600.0,515.3600,86400,1,1,1,production,1:0,2019-09-09T11:08:11
2659502,11874487,melogold,destin,153600.0,515.5200,86400,0,1,1,production,1:0,2019-09-09T11:09:36
2659505,11874501,melogold,destin,153600.0,515.3600,86400,0,1,1,production,1:0,2019-09-09T11:10:17
2659507,11874510,melogold,destin,153600.0,515.3100,86400,0,1,1,production,1:0,2019-09-09T11:11:47
2660018,11877453,forelle,cleva,5120.0,107.6300,7200,294,47,1,production,0:12,2019-09-09T11:53:37
2716932,11968213,forelle,cleva,5120.0,123.0000,14400,316,50,1,production,0:12,2019-09-11T10:58:37
2791778,12059885,melogold,destin,153600.0,514.2900,86400,0,1,1,production,1:0,2019-09-13T10:33:33
2797694,12067767,melogold,destin,153600.0,660.7200,86400,2,1,1,production,1:0,2019-09-13T14:32:18
2798084,12068215,melogold,destin,153600.0,515.2300,86400,9,1,1,production,1:0,2019-09-13T15:01:00
3258431,12658691,sunburst,belia,16384.0,10.7000,604800,9,8,8,production,0:9,2019-09-23T18:10:10
3259484,12660261,sunburst,belia,16384.0,10.6900,604800,7,8,8,production,0:9,2019-09-23T18:58:03
3259599,12660402,sunburst,belia,16384.0,12.4400,604800,10,8,8,production,0:9,2019-09-23T19:02:36
3259795,12660619,sunburst,belia,32768.0,12.5400,604800,6,8,8,production,0:9,2019-09-23T19:11:09

In [67]:
#shows the accounts and user of each account and how many jobs they committed that failed. 
error_code.groupby(['ACCOUNT','USER'])[['JOBID']].count()

                       JOBID
ACCOUNT     USER
atemoyas    benson         1
baby        christina      1
blood       jonnie         4
carrot      ari            1
cep         tremaine       1
cepuna      luvinia        1
chanterelle adalyn         2
durondeau   ginger         9
forelle     cleva          5
kumquat     icey           5
laxtons     otis          12
melogold    destin        23
milwa       charlotte      1
mixed       tavaris        5
morita      collins        3
pecans      acie           5
            shiela         2
            suzy           4
pinole      christa        5
president   diandra        1
stalk       wava           2
sunburst    belia          8
turban      andra          4

In [68]:
#error_code.SUBMIT.dt.hour.head()
#error_code.SUBMIT.dt.weekday_name.head()
#error_code.SUBMIT.dt.dayofyear.head()

In [69]:
#get just the hour out of the SUBMIT column
#error_code['hours']=error_code['SUBMIT'].dt.hour

In [70]:
#error_code.head()

In [71]:
#error_code['shifter']=error_code.SUBMIT.shift()

In [72]:
#error_code.head()

In [73]:
#diff. in hours
#error_code['diff_hours']=error_code['SUBMIT']-error_code['shifter']
#error_code['diff_hours']=error_code['diff_hours']/np.timedelta64(1,'h')

In [74]:
#error_code.head()

In [75]:
#error_code[error_code.diff_hours<= 4]

In [76]:
#sort by user, the user did jobs within 4 hours, deepcopy

In [316]:
#bring in the clean data again and work on part-2 of question one. Answering the within 4 hours mark
within='data/clean_data.csv'
within_4_hours = pd.read_csv(within)

In [317]:
within_4_hours.shape

(3319256, 12)

In [318]:
within_4_hours.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06

In [319]:
#converted the submit section to datetime type
within_4_hours['SUBMIT']=pd.to_datetime(within_4_hours.SUBMIT)

In [320]:
within_4_hours.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3319256 entries, 0 to 3319255
Data columns (total 12 columns):
JOBID        object
ACCOUNT      object
USER         object
REQMEM       float64
USEDMEM      float64
REQTIME      int64
USEDTIME     int64
NODES        int64
CPUS         int64
PARTITION    object
EXITCODE     object
SUBMIT       datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(4), object(5)
memory usage: 303.9+ MB

In [321]:
within_4_hours.head(2)

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09 16:38:44
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07 18:39:59

In [322]:
rolling_jobs=within_4_hours[within_4_hours.USEDTIME<300]

In [323]:
rolling_jobs.shape

(822925, 12)

In [324]:
rolling_jobs.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT
1638,7228228,cepuna,maryann,1024.0,0.09,216000,10,1,1,production,0:0,2019-03-19 14:14:19
2077,7233860,texas,miya,10240.0,44.04,36000,123,1,1,production,0:0,2019-03-19 20:19:03
2080,7233863,texas,miya,10240.0,0.09,36000,160,1,1,production,0:0,2019-03-19 20:19:44
2282,7234166_22,fairchild,docia,1024.0,1.21,36000,243,1,1,production,0:0,2019-03-19 21:07:46
2283,7234163_42,fairchild,docia,1024.0,0.09,36000,207,1,1,production,0:0,2019-03-19 21:07:42

In [326]:
#rolling_jobs=within_4_hours.groupby('USER').rolling(on='SUBMIT',window='4H').JOBID.count()
rolling_jobs=rolling_jobs.groupby('USER').rolling(on='SUBMIT',window='4h').JOBID.count()

In [327]:
rolling_jobs.shape

(822925,)

In [328]:
rolling_jobs.head()

USER     SUBMIT
abigail  2019-03-26 15:27:33    1.0
         2019-03-27 03:38:27    1.0
         2019-03-27 11:13:51    1.0
         2019-03-27 11:20:34    2.0
         2019-03-29 11:57:09    1.0
Name: JOBID, dtype: float64

In [329]:
rolling_jobs=rolling_jobs[rolling_jobs>500]

In [330]:
rolling_jobs.head()

USER     SUBMIT
adelina  2019-04-04 14:38:00    501.0
         2019-04-04 14:38:04    502.0
         2019-04-04 14:38:04    503.0
         2019-04-04 14:38:04    504.0
         2019-04-04 14:38:04    505.0
Name: JOBID, dtype: float64

In [331]:
rolling_jobs.head()

USER     SUBMIT
adelina  2019-04-04 14:38:00    501.0
         2019-04-04 14:38:04    502.0
         2019-04-04 14:38:04    503.0
         2019-04-04 14:38:04    504.0
         2019-04-04 14:38:04    505.0
Name: JOBID, dtype: float64

In [309]:
rolling_jobs.shape

(535961,)

In [310]:
#convert rolling jobs to dataframe
rolling_data=pd.DataFrame(rolling_jobs)

In [311]:
#reset the index
#df = df.reset_index(drop=True)
rolling_data=rolling_data.reset_index()

In [312]:
#rename the columns
rolling_data=rolling_data.rename(columns={'JOBID':'JOB_COUNT'})

In [313]:
#this answers the question 1 part 2. the number of users who committed small jobs at short time within 4 hours
rolling_data=rolling_data.groupby('USER')[['JOB_COUNT']].max()

In [314]:
rolling_data

          JOB_COUNT
USER
adelina      3247.0
aileen       1484.0
alene         718.0
alf          2000.0
alisson       733.0
archie       2468.0
baylee      10729.0
benson      12287.0
boyce        7648.0
brande       8173.0
callie        671.0
demarcus    23759.0
docia         954.0
gemma        2428.0
hjalmar      1109.0
jabbar        737.0
jamey         758.0
jayleen       603.0
jermaine     2965.0
jolette       519.0
jones        1843.0
kalen         761.0
kaye         1343.0
lashawn      1487.0
leaner       2318.0
leva         6292.0
lyman         930.0
macey         643.0
mikala      12795.0
milford       920.0
monna        1047.0
obie         1260.0
olan          631.0
osborne      1604.0
pamelia      2436.0
ressie       2118.0
shiela       7523.0
somer        3245.0
stacey       2417.0
stanley       947.0
stefanie      650.0
tamekia       652.0
tegan        1036.0
tommie       4994.0
treena        506.0
vaughn        703.0
whitley     11126.0

In [315]:
rolling_data.count()

JOB_COUNT    47
dtype: int64

In [99]:
# I want the  user that comminted small jobs at short time. whether they were arrays or single jobs/

In [335]:
#bring in the clean data again and work on question 3
percent='data/clean_data.csv'
grp_percent = pd.read_csv(percent)

In [336]:
grp_percent.shape

(3319256, 12)

In [337]:
#keep only successful jobs. meaning keep all exit code that contain 0:0
#initial_data=initial_data.loc[initial_data['EXITCODE']=='0:0']
grp_percent=grp_percent.loc[grp_percent['EXITCODE']=='0:0']

In [352]:
grp_percent=grp_percent.loc[grp_percent['NODES']==1]

In [353]:
grp_percent.shape

(3315147, 13)

In [354]:
grp_percent.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3315147 entries, 0 to 3319255
Data columns (total 13 columns):
JOBID           object
ACCOUNT         object
USER            object
REQMEM          float64
USEDMEM         float64
REQTIME         int64
USEDTIME        int64
NODES           int64
CPUS            int64
PARTITION       object
EXITCODE        object
SUBMIT          object
memory_usage    float64
dtypes: float64(3), int64(4), object(6)
memory usage: 354.1+ MB

In [355]:
grp_percent.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT,memory_usage
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44,46.494512
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59,53.028158
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06,0.000732
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06,67.820801
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06,67.578369

In [247]:
#converted the submit section to datetime type
#grp_percent['SUBMIT']=pd.to_datetime(grp_percent.SUBMIT)

In [342]:
grp_percent['memory_usage']=((grp_percent.USEDMEM)/(grp_percent.REQMEM))*100

In [343]:
grp_percent.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT,memory_usage
0,6794220,laxtons,mikala,15488.0,7201.07,1209600,955970,1,16,production,0:0,2019-03-09T16:38:44,46.494512
1,6983193_1880,discovery,serina,12288.0,6516.10,1188000,1070801,1,1,production,0:0,2019-03-07T18:39:59,53.028158
2,7055502_1863,discovery,serina,12288.0,0.09,1188000,1153656,1,1,production,0:0,2019-03-11T10:06:06,0.000732
3,7055502_1800,discovery,serina,12288.0,8333.82,1188000,1050659,1,1,production,0:0,2019-03-11T10:06:06,67.820801
4,7055502_1806,discovery,serina,12288.0,8304.03,1188000,981826,1,1,production,0:0,2019-03-11T10:06:06,67.578369

In [356]:
#check one of the users.throw it out!maybe
grp_percent[grp_percent.ACCOUNT=='blood']

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT,memory_usage
250979,7737740,blood,jonnie,1024.0,516.71,1800,39,1,1,production,0:0,2019-04-12T12:53:42,50.459961
252537,7742321,blood,jonnie,1024.0,3363.05,1800,796,1,1,production,0:0,2019-04-12T14:57:56,328.422852

In [345]:
grp_average=grp_percent.groupby('ACCOUNT',as_index=False)[['memory_usage']].mean()

In [349]:
grp_average.head()

    ACCOUNT  memory_usage
0   alkmene     31.647492
1   almonds     16.996319
2  amaranth      7.814561
3   antares     19.051164
4      arra     43.335769

In [348]:
grp_average.shape

(111, 2)

In [350]:
grp_average[grp_average['memory_usage']>90].groupby('ACCOUNT')['memory_usage'].value_counts()
#grp_percent[grp_percent['memory_usage']>98].groupby(['ACCOUNT','USER'])['memory_usage'].mean()

ACCOUNT  memory_usage
blood    189.441406      1
shiny    90.232215       1
Name: memory_usage, dtype: int64

In [177]:
grp_percent=grp_percent[grp_percent['memory_usage']>98]

In [178]:
grp_percent.head()

,JOBID,ACCOUNT,USER,REQMEM,USEDMEM,REQTIME,USEDTIME,NODES,CPUS,PARTITION,EXITCODE,SUBMIT,memory_usage
9,7064932,mickey,lavonda,2048.0,2047.97,1209600,800796,1,1,production,0:0,2019-03-11 17:03:30,99.998535
10,7064942,mickey,lavonda,2048.0,2048.00,1209600,855730,1,1,production,0:0,2019-03-11 17:03:47,100.000000
11,7064947,mickey,lavonda,2048.0,2044.64,1209600,735216,1,1,production,0:0,2019-03-11 17:03:47,99.835938
13,7064955,mickey,lavonda,2048.0,2047.98,1209600,1050067,1,1,production,0:0,2019-03-11 17:05:09,99.999023
14,7064957,mickey,lavonda,2048.0,2043.87,1209600,820341,1,1,production,0:0,2019-03-11 17:05:09,99.798340

In [334]:
# What is the sum of durations, for calls only, to each network
#data[data['item'] == 'call'].groupby('network')['duration'].sum()
grp_percent[grp_percent['memory_usage']>98].groupby(['ACCOUNT','USER'])['memory_usage'].mean()

ACCOUNT       USER
alkmene       ilene          98.732733
              melvyn         99.140747
              tomeka         99.621552
almonds       obie           99.941459
              robt           99.982178
antares       isadora        99.671852
              leyla          99.747327
              sam            99.271362
atemoyas      felecia        99.232324
              katrina        99.888338
blackberries  kalene         99.954834
blood         jonnie        215.536621
brazilnuts    glenda         99.687310
celery        justen         99.619888
cepuna        bret           99.997200
              maryann        99.767904
chanterelle   tremaine      220.326318
clara         gemma          99.299541
              gerrit         99.673615
cn121         tod            99.999634
crab          abigail        99.791028
              delila         99.155833
              shannon        99.626198
dill          mikala         99.987627
              mina           99.978809
discovery     lindsay        99.757671
              serina         99.693749
enoki         demonte        98.648853
flamingo      alisson        98.744406
              arne           99.998164
                              ...
pecans        alba           99.998047
              brigette       99.999609
              hildegard      99.986572
              marlena        99.998210
              sherman        99.616753
pinova        darold         99.457306
pioppino      stefanie       99.393433
plumcot       haleigh        98.056641
              santiago       98.976929
portabella    daryn         159.655029
              monna         189.975586
              romello       140.547567
              tommie        270.444165
president     diandra        99.997724
              epsie          99.999146
              izabella       99.998083
seeded        leva           99.602122
shell         penny          99.999792
shiny         arlie          99.928069
sommerfeld    whitley        99.702412
spring        olga           99.953591
stalk         wava         1150.016671
strawberries  debbra         99.996547
sunburst      rosalie       293.506445
sweet         somer          99.811920
texas         clayton        99.493734
treviso       aylin          99.266650
wax           porfirio       98.932922
winged        gibson         99.258791
              glenda         99.676500
Name: memory_usage, Length: 97, dtype: float64

In [188]:
grp_percent.groupby('ACCOUNT')['memory_usage'].mean()

ACCOUNT
alkmene           99.576186
almonds           99.941571
antares           99.353794
atemoyas          99.748100
blackberries      99.954834
blood            215.536621
brazilnuts        99.687310
celery            99.619888
cepuna           110.937312
chanterelle      200.271881
clara             99.555237
cn121             99.999634
crab              99.702384
dill              99.986157
discovery         99.718213
enoki             98.648853
flamingo          99.445584
forelle         3857.516299
francis           99.366881
galangal          99.795370
hass              99.999695
horseradish       99.835786
josephine         99.999777
kumquat          104.165025
laxtons           99.972671
leaves            99.999146
lemon             99.862071
maltaise          99.781401
medium            99.999373
melogold          99.997036
mickey            99.861563
milwa           2634.397287
morita          6965.278988
pasilla           99.660270
pecans            99.620822
pinova            99.457306
pioppino          99.393433
plumcot           98.874674
portabella       229.105659
president         99.998164
seeded            99.602122
shell             99.999792
shiny             99.928069
sommerfeld        99.702412
spring            99.953591
stalk           9975.990225
strawberries      99.996547
sunburst         293.506445
sweet             99.811920
texas             99.493734
treviso           99.266650
wax               98.932922
winged            99.554668
Name: memory_usage, dtype: float64